3DR/S2/background/constant/dynamicMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      motionProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

motionSolverLibs    ("libsixDoFRigidBodyMotion.so");

dynamicFvMesh       dynamicOversetFvMesh;

dynamicOversetFvMeshCoeffs
{
}

motionSolver        sixDoFRigidBodyMotion;

sixDoFRigidBodyMotionCoeffs
{
    patches         (floatingObject);
    innerDistance   100;	
    outerDistance   101;	

    centreOfMass    (2.725 0 0.5515);
		

    // Cylinder mass
    mass            18.7;	
	
    //moment of inertia about the centre of mass

    momentOfInertia (0.852	0.2258	0.9895);
	
    report          on;
    accelerationRelaxation 	0.95;
	accelerationDamping    1.00;


    solver
    {
        type Newmark;
    }
	
	// Degree = 60
    
	
	
	
	
	
	
	
	
	

}


// ************************************************************************* //
